OpenDTEF-v1912/tutorials/incompressible/simpleFoam/bump2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 469.872; // computed from omega and k

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            symmetryPlane;
    }

    "(symUp|symDown)"
    {
        type            symmetryPlane;
    }

    bump
    {
        type            epsilonWallFunction;
        value           $internalField;
        lowReCorrection on;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
